# What Makes Successful Movies? Database

## Attributions

"This product uses the TMDB API but is not endorsed or certified by TMDB."

In [1]:
from IPython.core.display import SVG
SVG(filename='Data/tmdblogo-blue_long_2.svg')

## Import Packages

In [2]:
# Standard Imports
import numpy as np
import pandas as pd

# Additional Imports
import json#, time, os

# Permanently changes the pandas settings
#pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)
#pd.set_option('display.width', None)
#pd.set_option('display.max_colwidth', None)

# SQLalchemy
from sqlalchemy.types import *
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

## Support special characters in MySQL password
from urllib.parse import quote_plus

## Load Data

In [3]:
# Load in the specified files from previous notebooks:
# Title Basics. Title Ratings. TMDB API Results.csv.gz (2). 
basics = pd.read_csv('Data/basics_final.csv.gz')     # Title Basics.
ratings = pd.read_csv('Data/ratings_final.csv.gz')   # Title Ratings.
final_tmdb_data_2000 = pd.read_csv('Data/final_tmdb_data_2000.csv.gz')   
final_tmdb_data_2001 = pd.read_csv('Data/final_tmdb_data_2001.csv.gz')

In [4]:
# Verify file read correctly
ratings.head(2)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1983
1  tt0000002            5.8       265

In [5]:
# Verify file read correctly
final_tmdb_data_2000.head(2)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,Two rural teens sing and dance their way throu...,2.01,/hfO64mXz3DgUxkBVU7no2UWRP7x.jpg,"[{'id': 51207, 'logo_path': None, 'name': 'Sul...","[{'iso_3166_1': 'US', 'name': 'United States o...",2000-09-22,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN

In [6]:
# Verify file read correctly
final_tmdb_data_2001.head(2)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0035423,0.0,/hfeiSfWYujh6MKhtGTXyK3DD4nN.jpg,NaN,48000000.0,"[{'id': 10749, 'name': 'Romance'}, {'id': 14, ...",NaN,11232.0,en,Kate & Leopold,When her scientist ex-boyfriend discovers a po...,12.916,/mUvikzKJJSg9khrVdxK8kg3TMHA.jpg,"[{'id': 85, 'logo_path': None, 'name': 'Konrad...","[{'iso_3166_1': 'US', 'name': 'United States o...",2001-12-25,76019048.0,118.0,"[{'english_name': 'French', 'iso_639_1': 'fr',...",Released,"If they lived in the same century, they'd be p...",Kate & Leopold,0.0,6.33,1202.0,PG-13

In [7]:
# Verify file read correctly
basics.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History"

In [8]:
# Drop columns that stakeholders are not wanting included
basics = basics[['tconst', 'primaryTitle', 'startYear', 'endYear', 'runtimeMinutes', 'genres']]
basics.head(2)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0043139,Life of a Beijing Policeman,2013,NaN,120,"Drama,History"

### Combine Separated final_tmdb_data_YEAR files

In [9]:
# Get info on each year's df
display(final_tmdb_data_2000.info())
display(final_tmdb_data_2001.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1249 entries, 0 to 1248
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                1249 non-null   object
 1   adult                  1248 non-null   float64
 2   backdrop_path          696 non-null    object
 3   belongs_to_collection  117 non-null    object
 4   budget                 1248 non-null   float64
 5   genres                 1248 non-null   object
 6   homepage               63 non-null     object
 7   id                     1248 non-null   float64
 8   original_language      1248 non-null   object
 9   original_title         1248 non-null   object
 10  overview               1227 non-null   object
 11  popularity             1248 non-null   float64
 12  poster_path            1131 non-null   object
 13  production_companies   1248 non-null   object
 14  production_countries   1248 non-null   object
 15  release_date           1239 non-null   object
 16  revenue                1248 non-null   float64
 17  runtime                1248 non-null   float64
 18  spoken_languages       1248 non-null   object
 19  status                 1248 non-null   object
 20  tagline                556 non-null    object
 21  title                  1248 non-null   object
 22  video                  1248 non-null   float64
 23  vote_average           1248 non-null   float64
 24  vote_count             1248 non-null   float64
 25  certification          394 non-null    object
dtypes: float64(9), object(17)
memory usage: 253.8+ KB

None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1342 entries, 0 to 1341
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                1342 non-null   object
 1   adult                  1341 non-null   float64
 2   backdrop_path          726 non-null    object
 3   belongs_to_collection  93 non-null     object
 4   budget                 1341 non-null   float64
 5   genres                 1341 non-null   object
 6   homepage               108 non-null    object
 7   id                     1341 non-null   float64
 8   original_language      1341 non-null   object
 9   original_title         1341 non-null   object
 10  overview               1315 non-null   object
 11  popularity             1341 non-null   float64
 12  poster_path            1210 non-null   object
 13  production_companies   1341 non-null   object
 14  production_countries   1341 non-null   object
 15  release_date           1327 non-null   object
 16  revenue                1341 non-null   float64
 17  runtime                1341 non-null   float64
 18  spoken_languages       1341 non-null   object
 19  status                 1341 non-null   object
 20  tagline                557 non-null    object
 21  title                  1341 non-null   object
 22  video                  1341 non-null   float64
 23  vote_average           1341 non-null   float64
 24  vote_count             1341 non-null   float64
 25  certification          419 non-null    object
dtypes: float64(9), object(17)
memory usage: 272.7+ KB

None

In [10]:
# Concat each year's file into one & check total entries are now the sum of the previous two
final_tmdb_data = pd.concat([final_tmdb_data_2000, final_tmdb_data_2001])
display(final_tmdb_data.head(2), final_tmdb_data.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2591 entries, 0 to 1341
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2591 non-null   object
 1   adult                  2589 non-null   float64
 2   backdrop_path          1422 non-null   object
 3   belongs_to_collection  210 non-null    object
 4   budget                 2589 non-null   float64
 5   genres                 2589 non-null   object
 6   homepage               171 non-null    object
 7   id                     2589 non-null   float64
 8   original_language      2589 non-null   object
 9   original_title         2589 non-null   object
 10  overview               2542 non-null   object
 11  popularity             2589 non-null   float64
 12  poster_path            2341 non-null   object
 13  production_companies   2589 non-null   object
 14  production_countries   2589 non-null   object
 15  release_date           2566 non-null   object
 16  revenue                2589 non-null   float64
 17  runtime                2589 non-null   float64
 18  spoken_languages       2589 non-null   object
 19  status                 2589 non-null   object
 20  tagline                1113 non-null   object
 21  title                  2589 non-null   object
 22  video                  2589 non-null   float64
 23  vote_average           2589 non-null   float64
 24  vote_count             2589 non-null   float64
 25  certification          813 non-null    object
dtypes: float64(9), object(17)
memory usage: 546.5+ KB

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,Two rural teens sing and dance their way throu...,2.01,/hfO64mXz3DgUxkBVU7no2UWRP7x.jpg,"[{'id': 51207, 'logo_path': None, 'name': 'Sul...","[{'iso_3166_1': 'US', 'name': 'United States o...",2000-09-22,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN

None

### Drop unneeded features from 'final_tmdb_data'

In [11]:
# Remove features not wanted by stakeholders:
# Keep only Movie ID ('imdb_id'), 'revenue', 'budget', MPAA Rating ('certification')
final_tmdb_data = final_tmdb_data[['imdb_id', 'revenue', 'budget', 'certification']]
display(final_tmdb_data.head(2))
display(final_tmdb_data.info())

     imdb_id  revenue      budget certification
0          0      NaN         NaN           NaN
1  tt0113026      0.0  10000000.0           NaN

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2591 entries, 0 to 1341
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2591 non-null   object
 1   revenue        2589 non-null   float64
 2   budget         2589 non-null   float64
 3   certification  813 non-null    object
dtypes: float64(2), object(2)
memory usage: 101.2+ KB

None

## Normalize 'Genre'

### Get Unique List of All Genres

In [12]:
# Create column with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics.head(2)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0043139,Life of a Beijing Policeman,2013,NaN,120,"Drama,History","[Drama, History]"

In [13]:
# Separate list of genres into new rows, one for each genre a movie belonged to
exploded_genres = basics.explode('genres_split')
exploded_genres.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0043139,Life of a Beijing Policeman,2013,NaN,120,"Drama,History",Drama
1,tt0043139,Life of a Beijing Policeman,2013,NaN,120,"Drama,History",History

In [14]:
# Save list of unique genres from 'genres_split'
unique_genres = sorted(exploded_genres['genres_split'].unique())
print(type(unique_genres))
unique_genres

<class 'list'>

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

### Create new 'title_genres' table

In [15]:
# use exploded df. Save only 'tconst' and 'genres_split' as new df
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0043139        Drama
1  tt0043139      History

### Create a genre mapper dictionary

In [30]:
# Create mapper dictionary to replace string genres with integers
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
print(type(genre_map))
genre_map

<class 'dict'>

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [17]:
title_genres.head(2)

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy

In [18]:
# Replace string genres in 'title_genres' with new integer IDs
title_genres['genres_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns = 'genres_split')
title_genres.head(2)

      tconst  genres_id
0  tt0035423          5
0  tt0035423          9

### Convert 'genre_map' dictionary into a dataframe

In [19]:
# Manually make dataframe with named columns from .keyd and .values
genre_lookup = pd.DataFrame({'Genre_Name': genre_map.keys(),
                             'Genre_ID': genre_map.values()})
genre_lookup

    Genre_Name  Genre_ID
0       Action         0
1        Adult         1
2    Adventure         2
3    Animation         3
4    Biography         4
5       Comedy         5
6        Crime         6
7        Drama         7
8       Family         8
9      Fantasy         9
10   Game-Show        10
11     History        11
12      Horror        12
13       Music        13
14     Musical        14
15     Mystery        15
16        News        16
17  Reality-TV        17
18     Romance        18
19      Sci-Fi        19
20       Sport        20
21   Talk-Show        21
22    Thriller        22
23         War        23
24     Western        24

## Save MySQL tables

Create new database named 'movies'

In [20]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"

## If your password contains a special character (like @, !, #, etc.), you will get an error message
# will need to add an additional step & function import to make your password connection-string-compatible. 
# Import the "quote_plus" function from "urllib.parse" and use this function to make your password variable connection-string-compatible.

# Type password between quotes below, delete value after adding to memory.
password = quote_plus("")  # delete value...!

db_name = "movies"
connection_str = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

engine = create_engine(connection_str)

In [21]:
## Check if database exists, if not, create it
if database_exists(connection_str) == False: 
    create_database(connection_str)
    print('New database created.')
else: 
    print('The database already exists.')

The database already exists.

### Create Table: title_basics

Create datatype schema for 'to_sql'

In [77]:
# Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
genre_len = genre_lookup['Genre_Name'].fillna('').map(len).max()
imdb_len = final_tmdb_data['imdb_id'].fillna('').map(len).max()
cert_len = final_tmdb_data['certification'].fillna('').map(len).max()

# Create schema dictionary using Sqlalchemy datatype objects
df_schema = {
    'tconst': String(key_len+1),
    'primaryTitle': Text(title_len+1),
    'startYear': Float(),
    'endYear': Float(),
    'runtimeMinutes': Integer(),
    'averageRating': Float(),
    'numVotes': Integer(),
    'genres_id': Integer(),
    'Genre_Name': Text(genre_len+1),
    'Genre_ID': Integer(),
    'imdb_id': String(imdb_len+1),
    'revenue': Float(),
    'budget': Float(),
    'certification': Text(cert_len+1)
    }

In [56]:
print(key_len)
print(title_len)
print(genre_len)

10
242
10

In [25]:
basics.head(1)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"

In [32]:
# Drop 'genres_split' from basics df, as no longer needed
basics = basics.drop(columns=('genres_split'))
basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0043139,Life of a Beijing Policeman,2013,NaN,120,"Drama,History"
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70,Drama
3,tt0069049,The Other Side of the Wind,2018,NaN,122,Drama
4,tt0088751,The Naked Monster,2005,NaN,100,"Comedy,Horror,Sci-Fi"

Run df.to_sql with the dtype argument

In [33]:
# Check if tables created
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_movies
0     title_basics

In [34]:
q = '''
SELECT * FROM title_basics;
'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [tconst, primaryTitle, startYear, endYear, runtimeMinutes, genres, genres_split]
Index: []

In [35]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

86886

In [36]:
# Run query to ADD PRIMARY KEY
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [37]:
# Verify table was created
q = '''
SELECT * FROM title_basics;
'''
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001.0,None,118,"Comedy,Fantasy,Romance"
1,tt0043139,Life of a Beijing Policeman,2013.0,None,120,"Drama,History"
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70,Drama
3,tt0069049,The Other Side of the Wind,2018.0,None,122,Drama
4,tt0088751,The Naked Monster,2005.0,None,100,"Comedy,Horror,Sci-Fi"
...,...,...,...,...,...,...
86881,tt9914942,Life Without Sara Amat,2019.0,None,74,Drama
86882,tt9915872,The Last White Witch,2019.0,None,97,"Comedy,Drama,Fantasy"
86883,tt9916170,The Rehearsal,2019.0,None,51,Drama
86884,tt9916190,Safeguard,2020.0,None,95,"Action,Adventure,Thriller"
86885,tt9916362,Coven,2020.0,None,92,"Drama,History"

### Create Table: title_ratings

In [41]:
ratings.head(2)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1983
1  tt0000002            5.8       265

In [38]:
# Check what tables were created
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_movies
0     title_basics

In [43]:
# Save to sql with dtype and index=False
ratings.to_sql('title_ratings',engine,dtype=df_schema,if_exists='replace',index=False)

502552

In [44]:
# Check what tables were created
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_movies
0     title_basics
1    title_ratings

In [45]:
# Run query to ADD PRIMARY KEY
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [46]:
# Verify table was created and its contents
q = '''
SELECT * FROM title_ratings;
'''
pd.read_sql(q, engine)

           tconst  averageRating  numVotes
0       tt0000001            5.7      1983
1       tt0000002            5.8       265
2       tt0000005            6.2      2623
3       tt0000006            5.1       182
4       tt0000007            5.4       821
...           ...            ...       ...
502547  tt9916200            8.1       230
502548  tt9916204            8.2       264
502549  tt9916348            8.3        18
502550  tt9916362            6.4      5395
502551  tt9916428            3.8        14

[502552 rows x 3 columns]

### Create Table: title_genres

In [47]:
title_genres.head(2)

      tconst  genres_id
0  tt0035423          5
0  tt0035423          9

In [49]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=df_schema,if_exists='replace',index=False)

162358

In [50]:
# Check what tables were created
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_movies
0     title_basics
1     title_genres
2    title_ratings

In [52]:
# No primary key required as this is a joiner table
# Verify table was created and its contents
q = '''
SELECT * FROM title_genres;
'''
pd.read_sql(q, engine)

           tconst  genres_id
0       tt0035423          5
1       tt0035423          9
2       tt0035423         18
3       tt0043139          7
4       tt0043139         11
...           ...        ...
162353  tt9916190          0
162354  tt9916190          2
162355  tt9916190         22
162356  tt9916362          7
162357  tt9916362         11

[162358 rows x 2 columns]

### Create Table: genres

In [54]:
genre_lookup.head(1)

  Genre_Name  Genre_ID
0     Action         0

In [57]:
# Save to sql with dtype and index=False
genre_lookup.to_sql('genres',engine,dtype=df_schema,if_exists='replace',index=False)

25

In [58]:
# Check what tables were created
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings

In [59]:
# No primary key required as this is a joiner table
# Verify table was created and its contents
q = '''
SELECT * FROM genres;
'''
pd.read_sql(q, engine)

    Genre_Name  Genre_ID
0       Action         0
1        Adult         1
2    Adventure         2
3    Animation         3
4    Biography         4
5       Comedy         5
6        Crime         6
7        Drama         7
8       Family         8
9      Fantasy         9
10   Game-Show        10
11     History        11
12      Horror        12
13       Music        13
14     Musical        14
15     Mystery        15
16        News        16
17  Reality-TV        17
18     Romance        18
19      Sci-Fi        19
20       Sport        20
21   Talk-Show        21
22    Thriller        22
23         War        23
24     Western        24

### Create Table: tmdb_data

In [69]:
final_tmdb_data.head(2)

     imdb_id  revenue      budget certification
0          0      NaN         NaN           NaN
1  tt0113026      0.0  10000000.0           NaN

In [78]:
# Save to sql with dtype and index=False
final_tmdb_data.to_sql('tmdb_data',engine,dtype=df_schema,if_exists='replace',index=False)

2591

In [79]:
# Check what tables were created
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data

In [73]:
# Verify table was created and its contents
# NEED TO REMOVE row 0, as it will throw an error when making 'imdb_id' the PRIMARY KEY
q = '''
SELECT * FROM tmdb_data;
'''
pd.read_sql(q, engine)

        imdb_id     revenue      budget certification
0             0         NaN         NaN          None
1     tt0113026         0.0  10000000.0          None
2     tt0113092         0.0         0.0          None
3     tt0116391         0.0         0.0          None
4     tt0118694  14204600.0    150000.0            PG
...         ...         ...         ...           ...
2586  tt7797790         0.0         0.0          None
2587  tt8665056         0.0         0.0          None
2588  tt8795764         0.0         0.0            NR
2589  tt9071078         0.0         0.0          None
2590  tt9212730         0.0         0.0          None

[2591 rows x 4 columns]

In [85]:
# REMOVE row 0, as it will throw an error when making 'imdb_id' the PRIMARY KEY
q = '''
DELETE FROM tmdb_data WHERE imdb_id = '0';
'''
pd.read_sql(q, engine)

In [86]:
# Verify row 0 was removed from table
q = '''
SELECT * FROM tmdb_data;
'''
pd.read_sql(q, engine)

        imdb_id     revenue      budget certification
0     tt0113026         0.0  10000000.0          None
1     tt0113092         0.0         0.0          None
2     tt0116391         0.0         0.0          None
3     tt0118694  14204600.0    150000.0            PG
4     tt0118852         0.0         0.0             R
...         ...         ...         ...           ...
2584  tt7797790         0.0         0.0          None
2585  tt8665056         0.0         0.0          None
2586  tt8795764         0.0         0.0            NR
2587  tt9071078         0.0         0.0          None
2588  tt9212730         0.0         0.0          None

[2589 rows x 4 columns]

In [87]:
# Run query to ADD PRIMARY KEY
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

# `imdb_id` already appears to be the primary key and throws an error when trying to make it primary key, again.

## Verify MySQL tables

In [88]:
# Verify what tables were created
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data